// 题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，
//      请问该数是多少？

// 程序分析：
// 假设该数为 x。
// 1. x + 100 = y * y
// 2. x + 100 + 168 = z * z
// 3. z * z - y * y = 168
// 由(z+y)(z-y)=168可设:
//  1. z+y=i
//  2. z-y=j
// 则:
//  3. i * j = 168, i和j至少一个是偶数
//  4. z=(i+j)/2,y=(i-j)/2, i和j要么同偶,要么同奇
//  由3，4可知，i和j均是大于等于2的偶数
//  由上面知:
//  1. 要么 j>=2，2<=j<i<168/2+1
//  2. 要么 j<=-2，-(168/2)-1<=i<j=<-2
//  3. 因为都是完全平方数的计算，只讨论情况1即可
//  因此，将i的所有数字循环计算即可得
#include <stdio.h>
int main() {
    int i, j, x, y, z;
    for (j = 2; j < 83; j = j + 2)
        if (168 % j == 0) {
            i = 168 / j;
            if (i > j && (i + j) % 2 == 0 && (i - j) % 2 == 0) {
                z = (i+j)/2;
                y = (i-j)/2;
                x = y * y - 100;
                printf ("%d + 100 = %d * %d\n", x, y, y);
                printf ("%d + 268 = %d * %d\n", x, z, z);
            }
        }
}